[
    {
        "title": "Rancang Bangun Aplikasi Pemesanan Dan Informasi Jasa Makeup Berbasis Android Menggunakan Metode Rapid Application Development",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3571",
        "abstract": "This application for ordering makeup services can make it easier for customers to order makeup services and make it easier for makeup to promote makeup services. Usually ordering makeup services is done manually by coming directly to the make-up place, for busy customers, of course it will take time to come directly to the make-up place to order their services, data collection by distributing questionnaires to customers and make-up. The purpose of this study is to create an application for ordering and information on android-based makeup services using the Rapid Application Development (RAD) method. The RAD method is a method of developing an information system with a relatively short time and has four stages, namely the requirements planning phase, the design phase, the construction phase and the implementation phase. When RAD is implemented, users can be part of the overall system development process by acting as decision makers at each stage of development. The results of this study are applications for ordering makeup services and information on makeup services by applying the Rapid Application Development method which can make it easier for customers to order makeup services and make it easier for makeup to promote makeup services. The application for ordering makeup services has a homepage, orders, and profile menus, in the application users can make orders, payments, make-up favorites, login and input makeup categories. In this study, blackbox testing and compatibility testing were carried out, testing was carried out on customers and make-up. The results of testing the application can run as expected, the application is responsive on various Android displays with various versions"
    },
    {
        "title": "Aplikasi Mobile Diagnosis Awal Penyakit Covid-19 Menggunakan Metode Forward Chaining",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3623",
        "abstract": "The disease covid-19 is caused by the coronavirus.\r\n\r\nCoronavirus is a virus that causes disease in humans and animals. Common symptoms of coronavirus infection include symptoms of acute respiratory distress such as fever, cough, and shortness of breath. Everyone in general is susceptible to being infected with the coronavirus.\r\nTherefore, it is very important to make an early diagnosis so that prevention or treatment can be carried out early. The diagnosis of the disease can be done directly by a doctor, but during a pandemic many people are worried and afraid if they are sick to come to the hospital to find information about their illness. From these problems, it can\r\nbe concluded that a mobile application for the early diagnosis of covid-19 is needed to help the community in diagnosing the early disease of covid-19. The mobile application for the early diagnosis of covid-19 was built using the forward chaining method. The forward chaining method is a method that includes variations of if for information and then for conclusions. By using the forward chaining method, the final result of the diagnosis for covid-19 can be known by the user. The results of the study show that this application can diagnose the initial disease of covid-19."
    },
    {
        "title": "Rancang Bangun Aplikasi Untuk Mengikuti Event Berbasis Mobile Menggunakan Metode Prototyping",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3525",
        "abstract": "Smartphones are items that many teenagers have today. Smartphones always get significant developments from time to time. This can be seen by the number of teenagers who use smartphones. The positive thing about smartphones, of course, is that we can make it easier for us to do difficult jobs. In addition to having a positive impact, smartphones also have negative impacts such as disrupting the development of youth creativity which is owned by teenagers because they always play with smartphones so they don't focus on learning and reduce direct interaction with friends and family. From these problems, it can be concluded that an application is needed that can accommodate teenagers who want to sharpen their talents and interests by participating in events and jobs in the application. This application was built by applying the Prototyping Method which can assist teenagers in expressing their desire to get applications according to their needs and translate needs in the form of a model, namely Prototype. Evaluation of the prototype uses the SUS (Sytem Usability Scale) questionnaire to measure usability aspects according to the user's subjective assessment. This proves that involving users in the design process will produce a product that meets user needs."
    },
    {
        "title": "Rancang Bangun Aplikasi Perhitungan Estimasi Biaya  Service Sepeda Motor Berbasis Android Menggunakan Metode Cost Significant Model",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3621",
        "abstract": "Motorcycle is one means of transportation that is often used by people in Indonesia. Due to the intensity of frequent use, it is not uncommon for motorcycles to experience minor or major damage, both to the engine part and the motor body. Usually, motorcycle service is carried out in automotive workshops, which are carried out by competent workers. Not everyone knows how much it costs to service a motorcycle, and the information obtained by the user is still not known by the user himself, to get information the user usually has to come to the motorcycle repair shop directly. Based on the above problems, an application for motorcycle service cost estimation is needed to make it easier for motorcycle owners to calculate the cost of each Android-based motorcycle service. The method used to perform the calculationIis the CostISignificant Model (CSM) which is an effective estimation method to provide an initial picture of costs."
    },
    {
        "title": "Aplikasi Layanan Ambulans Berbasis Android Dengan Metode Extreme Programming",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3556",
        "abstract": "Extreme Programming is a software engineering development methodology aimed at improving software quality against changes and customer needs. The development of this system is carried out in several stages, namely several stages, namely planning, designing, coding, and testing. Ambulansce is a vehicle equipped with medical equipment. These vehicles are used to carry people who are sick or have an accident. However, limited information in obtaining ambulansce services when there are people who need transportation to get to the puskesmas is still common. Not infrequently people experience difficulties and confusion when they want to order an ambulansce because they do not know how to contact the puskesmas or hospital to obtain ambulansce. Therefore, this research was conducted to build an Android-based ambulansce service application, especially for people in Bengkalis District. Through this application, the public can obtain data and make calls to ambulansce drivers. This application was built using Android Studio with the Java programming language, for the MySQL database and for application testing using Black Box Testing and Capability Testing. From the test results, it was\r\nfound that each test case made to test the application was successful and as expected."
    },
    {
        "title": "Aplikasi Mobile Dokumentasi Kebutuhan Perangkat Lunak Berbasis Standar IEEE std 830-1998",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3625",
        "abstract": "At this time, documenting data for software requirements is still done manually,with increasingly rapid technological developments, smartphones have helped various parties, especially requirements engineers in carrying out their work such as documenting software requirements. The purpose of this study is to build an mobile application for documentation of software requirements using the IEEE std 830-1998 standar. There are 2 types of IEEE standards used, namely, version 1 and version 2. This application makes it easier for engineers to document requirements for software according to standards, so that errors in writing structures or parts of software documents can be avoided. This application uses the Design Sprint development method."
    },
    {
        "title": "Aplikasi Pencarian Informasi Al-Qur'an Menggunakan Speech Recognition Berbasis Android",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3615",
        "abstract": "Al-Qur’an merupakan sebuah kitab suci dalam agama Islam, yang diturunkan oleh Allah kepada Nabi Muhammad SAW. Al-Qur’an mempunyai ayat didalam Al-Qur’an yang terdiri dari 30 juz, 114 surah dan 6236 ayat. Permasalahan yang sering muncul adalah  bagi para penghafal Al-Qur’an  atau bagi umat muslim yang ingin mempelajari Al-Qur’an membutuhkan waktu yang lama dalam mencari potongan ayat didalam Al-Qur’an. Hal itu disebabkan karena mereka harus menelusuri satu persatu arti kata setiap surahnya. Penelitian ini bertujuan membangun aplikasi pencarian informasi Al-Qur’an menggunakan speech recognition untuk mempermudah proses pencarian ayat ataupun surah didalam Al-Qur’an. Teknologi Speech Recognition memungkinkan suatu perangkat untuk mengenali dan memahami kata yang diucapkan dengan cara digitalisasi dan mencocokkan sinyal digital tersebut dengan suatu pola tertentu yang tersimpan dalam suatu perangkat. Speech Recognition dapat diterapkan untuk pencarian ayat pada aplikasi pencarian informasi Al-Qur’an berbasis android. Hasil dari aplikasi ini adalah dapat menerima inputan suara pada lingkungan tanpa noise, yaitu dengan jarak 50cm sampai 1m dengan rata-rata keberhasilan 85%."
    },
    {
        "title": "Penerapan Kanban Pada Pembuatan Software Pembelian Sampah di Bank Sampah Berseri Bengkalis",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3725",
        "abstract": "Garbage is leftover material that is no longer used from daily human activities. The Garbage Bank system is currently still manual in nature such as buying and selling waste from the Bengkalis community, waste price lists, types of waste and grouping waste categories. As a solution to these problems, the author builds a Software Design to digitize the previous system which was done manually. In this study the research methodology used is the Kanban method. In making this application the programming language used is PHP Framework Codeigniter, and MYSQL as a data storage area. With this application, it can help the Waste Bank to buy waste easily, safely and more efficiently."
    },
    {
        "title": "Penerapan Extreme Programming Untuk Rancang Bangun Aplikasi Penjualan dan Edukasi Pengelolaan Sampah Rumah Tangga",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3603",
        "abstract": "Garbage is leftover material that is no longer used from daily human activities. As a solution to these problems, the authors build a Software Design for Waste Management Educational Applications to educate the public and make it easier for people who want to sell waste. In this study the research methodology used is the Extreme Programming (XP) method. The Extreme Programming method conceptually can be done with 4 stages of the process, namely Planning, Design, Coding, and Testing. In making this application the programming language used is Kotlin, Codeigniter Framework, and MYSQL as a data storage area. With the existence of an educational application for waste management with educational content features such as articles or news, video tutorials, statistics on the distribution of waste, and being able to sell waste to help people want to sell waste that is no longer used online. Users of this application are people who can directly register as customers at the waste bank."
    },
    {
        "title": "Aplikasi Mading Online Untuk Politeknik Negeri Bengkalis Berbasis Web Menggunakan Metode Extreme Programming",
        "url": "http://eprints.polbeng.ac.id/id/eprint/3681",
        "abstract": "Mading is a wall magazine which is a written communication medium, the delivery of which is usually displayed on the wall of a campus. Mading is also one of the information media that students often use in finding academic information on campus, the current wall magazine is still using the manual system, namely by sticking paper on the wall. This is less efficient and less attractive so that students are lazy to see and read the mading. The Mading Manual is currently less operational because students use social media more often to provide other student information. With these factors, the researcher built an online Mading  Application for the Bengkalis State Polytechnic based on a website that students use to find information and provide information such as announcements, events, and others using the Extreme Programming (XP) method and there are several stages such as planning, design, coding and testing. resulting in a website-based online Mading Application that can make it easier for students to find academic information."
    }
]